{
  "description": "Osobista strona portfolio, sprawdź moją pracę i skontaktuj się ze mną.",
  "welcomeHeading": "Jestem Wojtek",
  "welcomeText": "— front-end i aspirujący full stack developer z umiejętnościami UI/UX designu.",
  "About": "O mnie",
  "Projects": "Projekty",
  "Resume": "Résumé",
  "showResume": "Pokaż",
  "downloadResume": "Pobierz",
  "Q1": "Dzisiaj przeprowadzimy wywiad z Wojciechem Salą, który jest 20-letnim front-end developerem, zaangażowanym również w design UI/UX. Czy to się zgadza Wojtek?",
  "A1": "Tak zgadza się, mam również troszkę doświadczenia z technologiami backendowymi oraz interesuję się ostatnio motion designem i animacją.",
  "Q2": "Co możesz nam powiedzieć o swoim doświadczeniu oraz projektach nad którymi pracowałeś?",
  "A2": "Programuję od 15 roku życia, więc przez ten czas miałem kilka mniejszych pomysłów. Najwięcej mimo wszystko nauczyłem się podczas pracy nad ostatnimi projektami większej skali, które tworzyłem w zespole, był to z pewnością wartościowy czas. Poznałem git od strony pracy zespołowej, postawiłem pewny krok w mobile development przy użyciu react-native oraz w cloud computing dzięki AWS. Po więcej informacji zapraszam na mojego GitHuba.",
  "Q3": "Jakie masz plany i aspiracje na przysłość?",
  "A3": "Przede wszystkim staram się znaleźć możliwość pracy w firmie, ponieważ mimo że jestem osobą samodzielną zdaję sobie sprawę jak duży wpływ ma bardziej doświadczony programista i ile można od niego zyskać. Stawiam na ciągły rozwój zarówno umiejętności miękkich jak i twardych oraz mojego głównego projektu. Przymierzam się również do kontrybuowania do projektów open-source.",
  "Q4": "Jakie technologie udało Ci się opanować przez czas twojej nauki?",
  "A4": "Przez czas jaki pracowałem nad swoimi pierwszymi projektami, zawsze zależało mi na niezależności i możliwości samodzielnego stworzenia całego projektu od zera./nW designie czuję się dobrze z/nJeśli mówimy o front-endzie to czuję się pewnie z/nNatomiast po stronie back-endu pracowałem z użyciem/nI kilka bardziej ogólnych",
  "Q5": "Ok, ostatnie pytanie to czy masz czas wolny na inne zainteresowania, jeśli tak to jakie?",
  "A5": "Haha pewnie, mimo wszystko uważam się za lenia. Lubię się uczyć nowych języków, w tym momencie jest to hiszpański i dobrze się to łączy z ambicjami do częstszsych podróży i zejść pod wodę z butlą na plecach. Jestem osobą, która lubi stawiać sobie nowe wyswania i uczyć się nowych rzeczy aby spędzić życie ciekawie.",
  "Q6": "Również wydaje mi się, że to bardzo istotne aby nasze krótkie życia były ciekawe i pełne wrażeń, wielkie dzięki za rozmowę.",
  "A6": "Było mi bardzo miło, do zobaczenia!"
}
